init.org
* Layout

#+begin_src emacs-lisp
(defconst display-name
  (pcase (display-pixel-width)
    (`3840 'dell-wide)
    (`4480 'imac)
    (`2560 'imac)
    (`1920 'macbook-pro-vga)
    (`1792 'macbook-pro-16)
    (`1680 'macbook-pro-15)
    ;; (`1680 'macbook-pro-13)
    ))

(defsubst bookerly-font (height)
  (format "-*-Bookerly-normal-normal-normal-*-%d-*-*-*-p-0-iso10646-1" height))

(defsubst dejavu-sans-mono-font (height)
  (format "-*-DejaVu Sans Mono-normal-normal-normal-*-%d-*-*-*-m-0-iso10646-1" height))

(defun emacs-min-font ()
  (pcase display-name
    ((guard alternate-emacs) (bookerly-font 18))
    (`imac (dejavu-sans-mono-font 18))
    (_     (dejavu-sans-mono-font 18))))

(defun emacs-min-font-height ()
  (aref (font-info (emacs-min-font)) 3))

(defun emacs-min-left ()
  (pcase display-name
    ((guard alternate-emacs)    0)
    (`dell-wide              1000)
    (`imac              (pcase (emacs-min-font-height)
                          (28  20)
                          (24 116)
                          (21 318)
                          (_    0)))
    (`macbook-pro-vga         700)
    (`macbook-pro-16          672)
    (`macbook-pro-15          464)
    (`macbook-pro-13          464)))

(defun emacs-min-height ()
  (pcase display-name
    ((guard alternate-emacs)   58)
    (`dell-wide                64)
    (`imac               (pcase (emacs-min-font-height)
                           (28 50)
                           (24 58)
                           (21 67)
                           (_  40)))
    (`macbook-pro-vga          55)
    (`macbook-pro-16           51)
    (`macbook-pro-15           47)
    (`macbook-pro-13           47)))

(defun emacs-min-width ()
  (pcase display-name
    ((guard alternate-emacs)   80)
    (`dell-wide               202)
    (`imac              (pcase (emacs-min-font-height)
                          (28 180)
                          (24 202)
                          (21 202)
                          (_  100)))
    (`macbook-pro-vga         100)
    (`macbook-pro-16          100)
    (`macbook-pro-15          100)
    (`macbook-pro-13          100)))

(defun emacs-min ()
  (interactive)
  (cl-flet ((set-param (p v) (set-frame-parameter (selected-frame) p v)))
    (set-param 'fullscreen nil)
    (set-param 'vertical-scroll-bars nil)
    (set-param 'horizontal-scroll-bars nil))
  (message "display-name:     %S" display-name)
  (message "Font name:        %s" (emacs-min-font))
  (message "Font height:      %s" (aref (font-info (emacs-min-font)) 3))
  (message "emacs-min-left:   %s" (emacs-min-left))
  (message "emacs-min-height: %s" (emacs-min-height))
  (message "emacs-min-width:  %s" (emacs-min-width))
  (and (emacs-min-left)
       (set-frame-position (selected-frame) (emacs-min-left) 0))
  (and (emacs-min-height)
       (set-frame-height (selected-frame) (emacs-min-height)))
  (and (emacs-min-width)
       (set-frame-width (selected-frame) (emacs-min-width)))
  (and (emacs-min-font)
       (set-frame-font (emacs-min-font)))
  (message "Emacs is ready"))

(defun emacs-max ()
  (interactive)
  (cl-flet ((set-param (p v) (set-frame-parameter (selected-frame) p v)))
    (set-param 'fullscreen 'fullboth)
    (set-param 'vertical-scroll-bars nil)
    (set-param 'horizontal-scroll-bars nil))
  (and (emacs-min-font)
       (set-frame-font (emacs-min-font))))

(defun emacs-toggle-size ()
  (interactive)
  (if (alist-get 'fullscreen (frame-parameters))
      (emacs-min)
    (emacs-max)))

(add-hook 'emacs-startup-hook #'emacs-min t)
#+end_src

** color-theme

#+begin_src emacs-lisp
(use-package color-theme
  :config
  (load "color-theme-library")
  (color-theme-midnight))
#+end_src

* Finalization

#+begin_src emacs-lisp
(let ((elapsed (float-time (time-subtract (current-time)
                                          emacs-start-time))))
  (message "Loading %s...done (%.3fs)" load-file-name elapsed))

(add-hook 'after-init-hook
          `(lambda ()
             (let ((elapsed
                    (float-time
                     (time-subtract (current-time) emacs-start-time))))
               (message "Loading %s...done (%.3fs) [after-init]"
                        ,load-file-name elapsed))) t)

(defun add-journal-entry (title)
  (interactive "sTitle: ")
  (let* ((moniker
          (replace-regexp-in-string
           "[,!]" ""
           (replace-regexp-in-string " " "-" (downcase title))))
         (most-recent
          (split-string
           (car (last (directory-files "~/doc/johnwiegley/posts"))) "-"))
         (year (nth 0 most-recent))
         (month (nth 1 most-recent))
         (day (nth 2 most-recent))
         (date (calendar-gregorian-from-absolute
                (+ 7 (calendar-absolute-from-gregorian
                      (list (string-to-number month)
                            (string-to-number day)
                            (string-to-number year))))))
         (path (expand-file-name (format "%02d-%02d-%02d-%s.md"
                                         (nth 2 date)
                                         (nth 0 date)
                                         (nth 1 date)
                                         moniker)
                                 "~/doc/johnwiegley/posts")))
    (switch-to-buffer (find-file path))
    (insert (format "---
title: %s
tags: journal
---

%s" title (current-kill 0)))))

(bind-key "C-c J" #'add-journal-entry)
#+end_src

* Gnus

#+begin_src emacs-lisp
(require 'gnus)
(require 'starttls)
(require 'message)
(eval-and-compile
  (require 'gnus-start)
  (require 'gnus-sum)
  (require 'gnus-art)
  (require 'mml))

(gnus-delay-initialize)

(defvar switch-to-gnus-unplugged nil)
(defvar switch-to-gnus-run nil)

(eval-when-compile
  (defvar ido-default-buffer-method)
  (declare-function ido-visit-buffer "ido"))

(defun switch-to-gnus (&optional arg)
  (interactive "P")
  (push-window-configuration)
  (let* ((alist '("\\`\\*unsent" "\\`\\*Summary" "\\`\\*Group"))
         (candidate
          (catch 'found
            (dolist (regexp alist)
              (dolist (buf (buffer-list))
                (if (string-match regexp (buffer-name buf))
                    (throw 'found buf)))))))
    (if (and switch-to-gnus-run candidate)
        (progn
          (if (featurep 'ido)
              (ido-visit-buffer candidate ido-default-buffer-method)
            (switch-to-buffer candidate))
          (if (string-match "Group" (buffer-name candidate))
              (gnus-group-get-new-news)))
      (let ((switch-to-gnus-unplugged arg))
        ;; (gnus)
        (gnus-unplugged)
        (gnus-group-list-groups gnus-activate-level)
        (gnus-group-get-all-new-news)
        (setq switch-to-gnus-run t)))))

(defun quickping (host)
  (= 0 (call-process "ping" nil nil nil "-c1" "-W50" "-q" host)))

(fset 'retrieve-attached-mail
      [?\C-d ?\C-n ?B ?c ?I ?N ?B ?O ?X return ?q ?\C-p ?B backspace ?\M-g])
#+end_src

** fetchmail-ctl

#+begin_src emacs-lisp
(use-package fetchmail-ctl
  :disabled t
  :after gnus-group
  :bind (:map gnus-group-mode-map
              ("v b" . switch-to-fetchmail)
              ("v d" . shutdown-fetchmail)
              ("v k" . kick-fetchmail)
              ;; ("v p" . fetchnews-post)
              ))
#+end_src

** gnus-sum

#+begin_src emacs-lisp
(use-package gnus-sum
  :bind (:map gnus-summary-mode-map
              ("F" . gnus-summary-wide-reply-with-original)))
#+end_src

