init.el
  (eshell-toggle nil)
  (switch-to-gnus)
  (switch-to-fetchmail)
  (jump-to-org-agenda)
  (org-resolve-clocks)
  (unless (eq display-name 'imac)
    (display-battery-mode 1))
  ;; (stock-quote "/ES")
  )

;;; init.el ends here
